<template>
  <h1>NuxtIsland</h1>
  <p>
    Nuxt Island — это классная, но экспериментальная функция Nuxt 3. Это
    специальный встроенный компонент, который позволяет полностью отображать
    компонент на сервере, что означает отсутствие использования клиентского
    JavaScript в браузере. Даже если вы используете SSR и HTML-контент
    отображается на сервере, клиентский JS по-прежнему обслуживается и
    используется во время гидратации. С компонентом NuxtIsland гидрация
    отсутствует вообще.
  </p>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">

</style>
